// მასივიდან უდიდესი რიცხვის პოვნა
 //  0 1 2 3 4
arr=[3,5,7,8,2]
// ჯერ ვნახოთ  როგორ გავიგოთ ბოლო წევრი მასივში
let len=arr.length //ეს დაბეჭდავს მასივის სიგრძეს  5 ანუ გვაძლევს რიცხვს 5-ს
// აქ ვეუბნევით რომ მეხუთე ელემენტი დაბეჭდოს რაც არ არსებობს მაგ: arr[0],arr[1]....
console.log("მასივის სიგრძე=",len) 
//ამიტომ ვწერთ ესე, ანუ ვეუბნევით რომ მეოთხე ინდექსზე მყოფი დაბეჭდოს, (arr[len]-1 ეს ჩანაწერი შეცდომაა ანუ 5-1)
console.log("მასივის ბოლო წევრი =",arr[len-1])
//ეხლა ავიღოთ მასივი და დავალაგოთ  ზრდადობით
arr.sort((a,b)=>a-b)
console.log(arr)
//ხოლო უდიდესი იქნება ბოლო წევრი
console.log(arr[len-1])
//ან პირიქით კლებადობით და უდიდესი იქნება პირველი წევრი
arr.sort((a,b)=>b-a)
console.log(arr)
console.log(arr[0])

// დავწეროთ  ჩვენით და  არ გამოვიყენოთ ჩაშენებული ფუნქციები

let max=arr[0] // ჩავთვალთ რომ მაქსიმალური არის პირველი წევრი
for(let i=0;i<arr.length;i++){
    if(arr[i]>max){ // თუ რომელიმე i-ური წევრი მეტია max-ზე
        max=arr[i]  // მაშინ max იყოს ის i-ური წევრი
    }
}
console.log("max=",max)

// დავწეროთ ფუნქციით

function findMax(numarr){
    let max=numarr[0]
    for(let i=0;i<numarr.length;i++){
        if(numarr[i]>max){
            max=numarr[i]
        }
    }
    return max
}
console.log(findMax(arr))